# InvalidLocationLineJustificationFailure Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..InvalidLocationLineJustificationFailure Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Modify the location justification to a invalid value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidLocationLineJustificationFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidLocationLineJustificationFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidLocationLineJustificationFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace